# Loading, cleaning and preprocessing data with `pandas`

**September 08 2020**  
*Vincenzo Perri*

In the last unit, we have seen how we can read and store data in files and SQLite databases. Complementing these skills, we  now introduce `pandas`, a package that simplifies the storage, query, cleaning, and processing of multi-variate data sets in `python`. As we shall see later, `pandas` is also used internally in `pathpy`, making it particularly easy to convert networks and `pandas` data frames.

## `pandas` basics

If you are working with a plain `python` distribution, you will first have to install the package via `pip` as explained in P01. In the `Anaconda` distribution, it is already preinstalled and we can import the module as follows:

In [1]:
import pandas as pd

One of the most important classes in `pandas` is `DataFrame`. It represents a two-dimensional array with named rows and columns. As we shall see in the next unit, `pandas` works particularly well with `numpy`. We can create an empty DataFrame as follows:

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

We typically create data frames from existing data, stored e.g. in a file, `numpy` arrays or in a python dictionary. We can directly pass a dictionary with existing values to the constructor. By default, it is assumed that the keys of the dictionary are the column names, and the values are iterables that contain the row values. If we simply type the variable name in `juypter`, we get a formatted tabular representation that includes the column names as well as the row indices:

In [3]:
df = pd.DataFrame({'col1': [2, 6, 7, 45, 54, 2, 5, 3, 2, 4, 5, 7], 'col2': [42, 1, 2, 3, 1, 3, 3, 3, 3, 2, 2, 987], 'col3': [45, 12, 45, 33, 11, 3, 3, 3, 32, 2, 565, 86]})
df

    col1  col2  col3
0      2    42    45
1      6     1    12
2      7     2    45
3     45     3    33
4     54     1    11
5      2     3     3
6      5     3     3
7      3     3     3
8      2     3    32
9      4     2     2
10     5     2   565
11     7   987    86

The name `pandas` actually originates from **pa**nel **da**ta. Considering the original intention to store panel data, we can think of a dataframe as panel data in *long format*, i.e. the rows are different observations of the same measurables or features, which are stored in the columns. Typically we deal with a very large number of observations and we often want to peek at the data by just showing the first few rows. We can do this with the `head` function, which takes the number of rows to display as argument:

In [4]:
df.head(5)

   col1  col2  col3
0     2    42    45
1     6     1    12
2     7     2    45
3    45     3    33
4    54     1    11

Similarly, the `tail` function shows a given number of last rows in the data frame:

In [5]:
df.tail(5)

    col1  col2  col3
7      3     3     3
8      2     3    32
9      4     2     2
10     5     2   565
11     7   987    86

We can access all values in a given column (i.e. all observations of a given metric or feature) by passing the string name of the column as an index to the data frame.

In [6]:
print(df['col1'])
print(type(df['col1']))

0      2
1      6
2      7
3     45
4     54
5      2
6      5
7      3
8      2
9      4
10     5
11     7
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

As you see above, this actually returns a `pandas` `Series` object. If we instead want to get a `numpy` array with the values, we can use the `values` property of the `Series` object. This will return a `numpy` array, which - as we will see in the following unit - allows us to efficiently perform mathematical operations.

In [7]:
print(df['col1'].values)
print(type(df['col1'].values))

[ 2  6  7 45 54  2  5  3  2  4  5  7]
<class 'numpy.ndarray'>

The more explicit and thus recommended approach to turn `pandas` objects into `numpy` objects is an explicit call to `to_numpy()`, which in the example above yields a one-dimensional `numpy` array:

In [8]:
df['col1'].to_numpy()

array([ 2,  6,  7, 45, 54,  2,  5,  3,  2,  4,  5,  7], dtype=int64)

We can also call the `to_numpy` function on a whole data frame to obtain a matrix representation of the data set:

In [9]:
df.to_numpy()

array([[  2,  42,  45],
       [  6,   1,  12],
       [  7,   2,  45],
       [ 45,   3,  33],
       [ 54,   1,  11],
       [  2,   3,   3],
       [  5,   3,   3],
       [  3,   3,   3],
       [  2,   3,  32],
       [  4,   2,   2],
       [  5,   2, 565],
       [  7, 987,  86]], dtype=int64)

While using a column name as index with the single bracket notation returns the `Series` object that contains the actual row data, we can also use  the double bracket notation to generate a new data frame that contains a subsets of columns.

In [10]:
df[['col1', 'col3']]

    col1  col3
0      2    45
1      6    12
2      7    45
3     45    33
4     54    11
5      2     3
6      5     3
7      3     3
8      2    32
9      4     2
10     5   565
11     7    86

Note that using a single column name `col1` within double brackets **does** not return the same result as `df['col1']` (which returns a `Series` object rather than a data frame):

In [11]:
df[['col1']]

    col1
0      2
1      6
2      7
3     45
4     54
5      2
6      5
7      3
8      2
9      4
10     5
11     7

In [12]:
one_more_row = pd.DataFrame({'col1': [15], 'col2': [123], 'col3': [87]})
one_more_row

   col1  col2  col3
0    15   123    87

In [13]:
df = df.append(one_more_row, ignore_index=True)
df

    col1  col2  col3
0      2    42    45
1      6     1    12
2      7     2    45
3     45     3    33
4     54     1    11
5      2     3     3
6      5     3     3
7      3     3     3
8      2     3    32
9      4     2     2
10     5     2   565
11     7   987    86
12    15   123    87

If we want to add a column, we can just assign a list or numpy array to a new column index. Below, we use the `python` product operator on a list with a single item, which generates a list with multiple identical items:

In [14]:
one_more_column = [42]*13
df['col4'] = one_more_column
df

    col1  col2  col3  col4
0      2    42    45    42
1      6     1    12    42
2      7     2    45    42
3     45     3    33    42
4     54     1    11    42
5      2     3     3    42
6      5     3     3    42
7      3     3     3    42
8      2     3    32    42
9      4     2     2    42
10     5     2   565    42
11     7   987    86    42
12    15   123    87    42

## Reading and writing `pandas` data frames

The popularity of `pandas` is largely due to the convenient way in which we can load or store them from/to files or databases. We can, for instance, directly read data frames from SQL databases by specifying a database cursor and an SQL query string. Let us try this with the database that we created in the last unit of the previous practice lecture.

In [15]:
# %cd "P02 - data and collections"

import sqlite3

conn = sqlite3.connect("data/example.db")
word_freq = pd.read_sql_query("select * from word_freq;", conn)
conn.close()
word_freq.head()

        word  count
0  estragon:    3.0
1   charming    1.0
2      spot.    1.0
3          (    3.0
4         he    2.0

Similarly, we can directly store the rows and columns of a `pandas` data frame in an SQLite database as follows:

In [16]:
conn = sqlite3.connect("data/example_df.db")

df.to_sql('example_data', conn, if_exists='replace', index=False)

conn.commit()
conn.close()

Finally, storing a data frame as json or csv file is as simple as it can possibly get. We simply pass the file name to the `to_json` or `to_csv` function. Note that there are many other `to_x` functions for additional formats.

In [17]:
df.to_json('data/example_df.json')
df.to_csv('data/example_csv.csv')

## Cleaning, merging, and querying data

Another strength of `pandas` that makes it useful for data science projects in noisy and heterogeneous data is its support to filter, clean, merge and query data. Here we only have time for the absolute basics, which we will illustrate in two example data frames. For this, we will use the special `nan` (=not a number) value in `numpy`, a package that we will introduce in more detail in the next unit. The `nan` value is typically used for missing values. Compared to other ways to encode such values (e.g. as 0 or -1) the use of a special value avoids to confuse missing values with actual values.

Different from our example above, in the example data frames below we specify an additional column 'id' that helps us to identify the value of a specific observation. This could also be a numerical ID or the time stamp of a measurement. As we shall see in a moment, we can use such identifies to merge the values in multiple data frames.

In [18]:
import numpy as np

In [19]:
data1 = pd.DataFrame({'id': ['observ_1', 'observ_2', 'observ_3', 'observ_4', 'observ_5'], 'val1': [42.3, np.nan, 22.2, 12.3, 82.2]})

data2 = pd.DataFrame({'identifier': ['observ_2', 'observ_3', 'observ_4', 'observ_5', 'observ_6'], 'val2':[97.1, 23.8,  np.nan, 7.5, 978.3]})

In [20]:
data1

         id  val1
0  observ_1  42.3
1  observ_2   NaN
2  observ_3  22.2
3  observ_4  12.3
4  observ_5  82.2

In [21]:
data2

  identifier   val2
0   observ_2   97.1
1   observ_3   23.8
2   observ_4    NaN
3   observ_5    7.5
4   observ_6  978.3

The simplest way to deal with `na` values is to just drop them. We can do this using the function `dropna`, which returns a `DataFrame` in which all rows with `na` values have been removed.

In [22]:
data1.dropna()

         id  val1
0  observ_1  42.3
2  observ_3  22.2
3  observ_4  12.3
4  observ_5  82.2

Rather than deleting `na` values, we can also fill them with a given value, e.g. zero:

In [23]:
data2.fillna(value=0.0)

  identifier   val2
0   observ_2   97.1
1   observ_3   23.8
2   observ_4    0.0
3   observ_5    7.5
4   observ_6  978.3

Sometimes, we might want to simply replace missing values by the corresponding value that just occurs before or after the missing value. This is useful if, for instance, we have a time series and we simply repeat a previous measurement rather than setting the measurement to zero. For such scenarios, we can use the forward- or backward filling method:

In [14]:
data2.fillna(method='ffill')

  identifier   val2
0   observ_2   97.1
1   observ_3   23.8
2   observ_4   23.8
3   observ_5    7.5
4   observ_6  978.3

In [24]:
data1.fillna(method='bfill')

         id  val1
0  observ_1  42.3
1  observ_2  22.2
2  observ_3  22.2
3  observ_4  12.3
4  observ_5  82.2

Finally, we can perform merge or join operations on multiple data frames that have common values used as identifiers (i.e. keys). Consider the example above, where one data frame has a column `id` and another dataframe has a column `identifier`. We can use common values in those columns to create a single data frame that merges information from both data frames. For this we can use the `merge` function. by default, the function will look for columns with identical names and automatically merge data based on the values in this column. If the column names differ, we can set the `left_on` and `right_on` argument to specify which columns should be used for the join. Note that `left_on` refers to the data frame on which the `merge` function is called, while `right_on` refers to the data frame that is passed as argument of the `merge` function.

In [25]:
data = data1.merge(data2, left_on='id', right_on='identifier')
data

         id  val1 identifier  val2
0  observ_2   NaN   observ_2  97.1
1  observ_3  22.2   observ_3  23.8
2  observ_4  12.3   observ_4   NaN
3  observ_5  82.2   observ_5   7.5

In the resulting data frame we make two observations: (i) it contains both the columns `id` and `identifier` from the two original data frames, (ii) it only contains rows where a match between `data1` and `data2` was found. 

What if we want to retain all values, simply setting those values in data2 for which no corresponding entry in data1 exists to `nan` and vice-versa. This corresponds to different types of a `JOIN` operation, which exists with different semantics (LEFT, RIGHT, INNER, OUTER). In fact, `pandas` supports all variants of the `JOIN` semantics. You can use the `how` parameter to specify which `JOIN` you want to perform. If, for instance, we want to keep the rows in data1 for which no corresponding row in data2 exists and vice-versa, we need to use a full outer join. We can do this by setting `how` to the value `"outer"`.

In [26]:
data = data1.merge(data2, how='outer', left_on='id', right_on='identifier')
data

         id  val1 identifier   val2
0  observ_1  42.3        NaN    NaN
1  observ_2   NaN   observ_2   97.1
2  observ_3  22.2   observ_3   23.8
3  observ_4  12.3   observ_4    NaN
4  observ_5  82.2   observ_5    7.5
5       NaN   NaN   observ_6  978.3

We can now fill in missing values. For instance, we could replace all missing values of `id` by the corresponding value in `identifier` and then drop the column `identifier`. Replacing `nan` values by the value in another columns is a complex operation for which we cannot directly use `fillna`. However, we can use the `apply` function, which allows us to specify an arbitrary function or lambda expression that will be executed for each row or column (depending on the `axis` argument). For `axis=0` the function is applied to each column, while for `axis=1` it is applied to each row. 

The following code returns a new column of values, where `nan` values in the `id` column of each row are replaced by the corresponding value in the `identifier` column:

In [27]:
data.fillna('NA').apply(lambda row: row['identifier'] if row['id']=='NA' else row['id'], axis=1)

0    observ_1
1    observ_2
2    observ_3
3    observ_4
4    observ_5
5    observ_6
dtype: object

We can now assign this new column to the column with the name `id`:

In [28]:
data['id'] = data.fillna('NA').apply(lambda row: row['identifier'] if row['id']=='NA' else row['id'], axis=1)
data

         id  val1 identifier   val2
0  observ_1  42.3        NaN    NaN
1  observ_2   NaN   observ_2   97.1
2  observ_3  22.2   observ_3   23.8
3  observ_4  12.3   observ_4    NaN
4  observ_5  82.2   observ_5    7.5
5  observ_6   NaN   observ_6  978.3

We now drop the unneeded column `identifier` as follows:

In [29]:
data.drop(['identifier'], axis=1, inplace=True)
data

         id  val1   val2
0  observ_1  42.3    NaN
1  observ_2   NaN   97.1
2  observ_3  22.2   23.8
3  observ_4  12.3    NaN
4  observ_5  82.2    7.5
5  observ_6   NaN  978.3

We finally use the forward- and backward-fill method to obtain a data set without `na` values that we can use below:

In [30]:
data = data.fillna(method='ffill')
data = data.fillna(method='bfill')
data

         id  val1   val2
0  observ_1  42.3   97.1
1  observ_2  42.3   97.1
2  observ_3  22.2   23.8
3  observ_4  12.3   23.8
4  observ_5  82.2    7.5
5  observ_6  82.2  978.3

## Querying data

We often want to run our analyses on subsets of data that satisfy certain conditions. We thus need the ability to query data based on complex expressions. `pandas` provides support for such queries through the [`query`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html) function. For instance, we can get a `pandas` `DataFrame` that only contains rows that satisfy the following condition:

In [31]:
data.query('val1 - val2 > 10 or val2 - val1 > 5')

         id  val1   val2
0  observ_1  42.3   97.1
1  observ_2  42.3   97.1
3  observ_4  12.3   23.8
4  observ_5  82.2    7.5
5  observ_6  82.2  978.3

If you are interested in a full description of the supported query expressions, please refer to the [documentation of the `query` function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html). Apart from selecting data that satisfy certain conditions, we often want to randomly sample a subset of the data. For this, we can use the `sample` function. It takes the number of samples, as well as the sampling strategy (with or without replacement) as arguments:

In [32]:
data.sample(n=2)

         id  val1   val2
0  observ_1  42.3   97.1
5  observ_6  82.2  978.3

By default, the sampling is done **without** replacement, which is why the following code raises an error:

In [33]:
data.sample(n=10)

ValueError: Cannot take a larger sample than population when 'replace=False'

If we want to sample with replacement, we can specify the `replace` argument:

In [34]:
data.sample(n=10, replace=True)

         id  val1  val2
3  observ_4  12.3  23.8
2  observ_3  22.2  23.8
2  observ_3  22.2  23.8
0  observ_1  42.3  97.1
2  observ_3  22.2  23.8
3  observ_4  12.3  23.8
2  observ_3  22.2  23.8
0  observ_1  42.3  97.1
4  observ_5  82.2   7.5
2  observ_3  22.2  23.8

## Simple statistical analyses in `pandas` 

Finally, `pandas` supports basic descriptive statistics to explore data frames. We can compute aggregate functions like the mean, the variance, minimum or maximum along different axis (column = 0, row = 1) of a data frame:

In [35]:
data.mean(axis=0)

val1     47.25
val2    204.60
dtype: float64

In [36]:
data.var(axis=0)

val1       868.203
val2    145189.976
dtype: float64

In [37]:
data.mean(axis=1)

0     69.70
1     69.70
2     23.00
3     18.05
4     44.85
5    530.25
dtype: float64

In [38]:
data.max(axis=0)

id      observ_6
val1        82.2
val2       978.3
dtype: object

In [31]:
data.max(axis=1)

0     97.1
1     97.1
2     23.8
3     23.8
4     82.2
5    978.3
dtype: float64

As already seen before, we can use the `apply` function to compute arbitrary aggregate functions at the row or column or level. For instance, we can apply the `numpy` function `mean` to each column and return the result:

In [39]:
data[['val1', 'val2']].apply(np.mean, axis=0)

val1     47.25
val2    204.60
dtype: float64

Moreover, the `applymap` function allows us to apply a function to each element of a data frame, which comes in handy when we want to scale or transform data. If, for instance, we wanted to normalize the data we could first compute the maximum of all entries as follows:

In [40]:
m = data[['val1', 'val2']].max(axis=0).max()
print(m)

978.3

We can then replace the two columns `val1` and `val2` with normalised entries as follows:

In [41]:
data[['val1', 'val2']] = data[['val1', 'val2']].applymap(lambda x: x/m)
data

         id      val1      val2
0  observ_1  0.043238  0.099254
1  observ_2  0.043238  0.099254
2  observ_3  0.022692  0.024328
3  observ_4  0.012573  0.024328
4  observ_5  0.084023  0.007666
5  observ_6  0.084023  1.000000